# LAB 05 Data Preprocessing(3)

## 1. ë°ì´í„° ì¬êµ¬ì¡°í™” (1) - Pivot, Melt

### ë¼ì´ë¸ŒëŸ¬ë¦¬ ì°¸ì¡°

In [ ]:
from hossam import load_data
from pandas import pivot_table, melt,pivot

In [3]:
origin = load_data('city_people')
origin

[data] https://data.hossam.kr/data/lab05/city_people.xlsx
[desc] ì„œìš¸, ì¸ì²œ, ë¶€ì‚°ì—ì„œ 2005ë…„, 2010ë…„ 2015ë…„ì— ì¡°ì‚¬í•œ ê°€ìƒì˜ ì¸êµ¬ìˆ˜ ë°ì´í„°(ì¸ë±ìŠ¤ì™€ ë©”íƒ€ë°ì´í„° ì—†ìŒ)
[!] Cannot read metadata

   ë„ì‹œ    ì—°ë„       ì¸êµ¬   ì§€ì—­
0  ì„œìš¸  2015  9904312  ìˆ˜ë„ê¶Œ
1  ì„œìš¸  2010  9631482  ìˆ˜ë„ê¶Œ
2  ì„œìš¸  2005  9762546  ìˆ˜ë„ê¶Œ
3  ë¶€ì‚°  2015  3448737  ê²½ìƒê¶Œ
4  ë¶€ì‚°  2010  3393191  ê²½ìƒê¶Œ
5  ë¶€ì‚°  2005  3512547  ê²½ìƒê¶Œ
6  ì¸ì²œ  2015  2890451  ìˆ˜ë„ê¶Œ
7  ì¸ì²œ  2010  2632035  ìˆ˜ë„ê¶Œ

### í”¼ë²—í…Œì´ë¸”

#### 1. ê¸°ë³¸ ì‚¬ìš© ë°©ë²• (ë„ì‹œì™€ ì—°ë„ì— ë”°ë¥¸ ì¸êµ¬ìˆ˜ ì¬ë°°ì¹˜)

In [5]:
pivot1 = pivot_table(origin,
                     index='ë„ì‹œ',
                     columns='ì—°ë„',
                     values='ì¸êµ¬')
print(type(pivot1))
pivot1

<class 'pandas.core.frame.DataFrame'>

ì—°ë„       2005       2010       2015
ë„ì‹œ
ë¶€ì‚°  3512547.0  3393191.0  3448737.0
ì„œìš¸  9762546.0  9631482.0  9904312.0
ì¸ì²œ        NaN  2632035.0  2890451.0

#### 2. ì¤‘ë³µ ë°ì´í„°ì˜ ì§‘ê³„ ë°©ë²• ì§€ì •í•˜ê¸°

In [7]:
pivot_table(origin,
                     index='ë„ì‹œ',
                     columns='ì—°ë„',
                     values='ì¸êµ¬',
                     aggfunc = 'sum')

ì—°ë„       2005       2010       2015
ë„ì‹œ
ë¶€ì‚°  3512547.0  3393191.0  3448737.0
ì„œìš¸  9762546.0  9631482.0  9904312.0
ì¸ì²œ        NaN  2632035.0  2890451.0

In [8]:
pivot_table(origin,
                     index='ë„ì‹œ',
                     columns='ì—°ë„',
                     values='ì¸êµ¬',
                     aggfunc = ['sum','mean'])

          sum                             mean
ì—°ë„       2005       2010       2015       2005       2010       2015
ë„ì‹œ
ë¶€ì‚°  3512547.0  3393191.0  3448737.0  3512547.0  3393191.0  3448737.0
ì„œìš¸  9762546.0  9631482.0  9904312.0  9762546.0  9631482.0  9904312.0
ì¸ì²œ        NaN  2632035.0  2890451.0        NaN  2632035.0  2890451.0

In [12]:
pivot_table(origin,
                     index=['ì§€ì—­','ì—°ë„'],
                     columns='ë„ì‹œ',
                     values='ì¸êµ¬',
                     aggfunc = ['mean','sum'])

               mean                              sum
ë„ì‹œ               ë¶€ì‚°         ì„œìš¸         ì¸ì²œ         ë¶€ì‚°         ì„œìš¸         ì¸ì²œ
ì§€ì—­  ì—°ë„
ê²½ìƒê¶Œ 2005  3512547.0        NaN        NaN  3512547.0        NaN        NaN
    2010  3393191.0        NaN        NaN  3393191.0        NaN        NaN
    2015  3448737.0        NaN        NaN  3448737.0        NaN        NaN
ìˆ˜ë„ê¶Œ 2005        NaN  9762546.0        NaN        NaN  9762546.0        NaN
    2010        NaN  9631482.0  2632035.0        NaN  9631482.0  2632035.0
    2015        NaN  9904312.0  2890451.0        NaN  9904312.0  2890451.0

### Melt

In [17]:
pivot_df = pivot_table(origin,
                     index='ì—°ë„',
                     columns='ì§€ì—­',
                     values='ì¸êµ¬',
                     aggfunc = 'mean')

#### 2. í”¼ë²— í…Œì´ë¸” ë¶„ë¦¬

In [23]:
pivot_df2 = pivot_df.reset_index()
pivot_df

ì§€ì—­          ê²½ìƒê¶Œ        ìˆ˜ë„ê¶Œ
ì—°ë„
2005  3512547.0  9762546.0
2010  3393191.0  6131758.5
2015  3448737.0  6397381.5

#### 2ë‹¨ê³„ : í”¼ë²— í…Œì´ë¸”ì— ëŒ€í•œ ğ‘šğ‘’ğ‘™ğ‘¡ ì²˜ë¦¬

In [25]:
mdf = melt(pivot_df2,id_vars=['ì—°ë„'],value_vars=['ê²½ìƒê¶Œ','ìˆ˜ë„ê¶Œ'])
mdf

     ì—°ë„   ì§€ì—­      value
0  2005  ê²½ìƒê¶Œ  3512547.0
1  2010  ê²½ìƒê¶Œ  3393191.0
2  2015  ê²½ìƒê¶Œ  3448737.0
3  2005  ìˆ˜ë„ê¶Œ  9762546.0
4  2010  ìˆ˜ë„ê¶Œ  6131758.5
5  2015  ìˆ˜ë„ê¶Œ  6397381.5

In [26]:
mdf = melt(pivot_df2,id_vars=['ì—°ë„'],value_vars=['ê²½ìƒê¶Œ','ìˆ˜ë„ê¶Œ'],
           var_name='êµ¬ë¶„',value_name='ì¸êµ¬ìˆ˜')
mdf

     ì—°ë„   êµ¬ë¶„        ì¸êµ¬ìˆ˜
0  2005  ê²½ìƒê¶Œ  3512547.0
1  2010  ê²½ìƒê¶Œ  3393191.0
2  2015  ê²½ìƒê¶Œ  3448737.0
3  2005  ìˆ˜ë„ê¶Œ  9762546.0
4  2010  ìˆ˜ë„ê¶Œ  6131758.5
5  2015  ìˆ˜ë„ê¶Œ  6397381.5